tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86k90_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F86K90_H_
#define _PIC18F86K90_H_

#define LCDCON                        0
#define LMUX0                         1
#define LMUX                          2
#define LMUX1                         3
#define LCDCON_CS                     4
#define CS0                           5
#define CS1                           6
#define WERR                          7
#define SLPEN                         8
#define LCDEN                         9
#define LCDPS                         10
#define LP                            11
#define LP0                           12
#define LP1                           13
#define LP2                           14
#define LP3                           15
#define WA                            16
#define LCDA                          17
#define BIASMD                        18
#define WFT                           19
#define LCDSE0                        20
#define SE00                          21
#define SE01                          22
#define SE02                          23
#define SE03                          24
#define SE04                          25
#define SE05                          26
#define SE06                          27
#define SE07                          28
#define LCDSE1                        29
#define SE08                          30
#define SE09                          31
#define SE10                          32
#define SE11                          33
#define SE12                          34
#define SE13                          35
#define SE14                          36
#define SE15                          37
#define LCDSE2                        38
#define SE16                          39
#define SE17                          40
#define SE18                          41
#define SE19                          42
#define SE20                          43
#define SE21                          44
#define SE22                          45
#define SE23                          46
#define LCDSE3                        47
#define SE24                          48
#define SE25                          49
#define SE26                          50
#define SE27                          51
#define SE28                          52
#define SE29                          53
#define SE30                          54
#define SE31                          55
#define LCDSE4                        56
#define SE32                          57
#define SE33                          58
#define SE34                          59
#define SE35                          60
#define SE36                          61
#define SE37                          62
#define SE38                          63
#define SE39                          64
#define LCDSE5                        65
#define SE40                          66
#define SE41                          67
#define SE42                          68
#define SE43                          69
#define SE44                          70
#define SE45                          71
#define SE46                          72
#define SE47                          73
#define LCDRL                         74
#define LRLAT0                        75
#define LRLAT                         76
#define LRLAT1                        77
#define LRLAT2                        78
#define LCDIRI                        79
#define LRLBP                         80
#define LRLBP0                        81
#define LRLBP1                        82
#define LRLAP0                        83
#define LRLAP                         84
#define LRLAP1                        85
#define LCDREF                        86
#define VLCD1PE                       87
#define VLCD2PE                       88
#define VLCD3PE                       89
#define LCDCST0                       90
#define LCDCST                        91
#define LCDCST1                       92
#define LCDCST2                       93
#define LCDIRS                        94
#define LCDIRE                        95
#define SSP2CON2                      96
#define SEN2                          97
#define SSP2CON2_SEN                  98
#define ADMSK12                       99
#define SSP2CON2_RSEN                 100
#define RSEN2                         101
#define SSP2CON2_ADMSK1               102
#define ADMSK22                       103
#define PEN2                          104
#define SSP2CON2_PEN                  105
#define SSP2CON2_ADMSK2               106
#define ADMSK32                       107
#define SSP2CON2_RCEN                 108
#define RCEN2                         109
#define SSP2CON2_ADMSK3               110
#define ACKEN2                        111
#define ADMSK42                       112
#define SSP2CON2_ADMSK4               113
#define SSP2CON2_ACKEN                114
#define ACKDT2                        115
#define ADMSK52                       116
#define SSP2CON2_ACKDT                117
#define SSP2CON2_ADMSK5               118
#define SSP2CON2_ACKSTAT              119
#define ACKSTAT2                      120
#define SSP2CON2_GCEN                 121
#define GCEN2                         122
#define SSP2CON1                      123
#define SSP2CON1_SSPM                 124
#define SSP2CON1_SSPM0                125
#define SSPM02                        126
#define SSPM12                        127
#define SSP2CON1_SSPM1                128
#define SSP2CON1_SSPM2                129
#define SSPM22                        130
#define SSPM32                        131
#define SSP2CON1_SSPM3                132
#define SSP2CON1_CKP                  133
#define CKP2                          134
#define SSPEN2                        135
#define SSP2CON1_SSPEN                136
#define SSPOV2                        137
#define SSP2CON1_SSPOV                138
#define WCOL2                         139
#define SSP2CON1_WCOL                 140
#define SSP2STAT                      141
#define SSP2STAT_BF                   142
#define BF2                           143
#define SSP2STAT_UA                   144
#define UA2                           145
#define SSP2STAT_R_W                  146
#define SSP2STAT_I2C_READ             147
#define RW2                           148
#define SSP2STAT_R                    149
#define SSP2STAT_nW                   150
#define READ_WRITE2                   151
#define nW2                           152
#define SSP2STAT_nWRITE               153
#define I2C_READ2                     154
#define SSP2STAT_R_NOT_W              155
#define R_nW2                         156
#define SSP2STAT_READ_WRITE           157
#define nWRITE2                       158
#define R_W2                          159
#define SSP2STAT_R_nW                 160
#define SSP2STAT_NOT_WRITE            161
#define SSP2STAT_S                    162
#define S2                            163
#define START2                        164
#define SSP2STAT_I2C_START            165
#define I2C_START2                    166
#define P2                            167
#define SSP2STAT_I2C_STOP             168
#define SSP2STAT_P                    169
#define STOP2                         170
#define I2C_STOP2                     171
#define I2C_DAT2                      172
#define SSP2STAT_D                    173
#define DATA_ADDRESS2                 174
#define SSP2STAT_D_NOT_A              175
#define SSP2STAT_I2C_DAT              176
#define D_A2                          177
#define SSP2STAT_NOT_ADDRESS          178
#define SSP2STAT_D_nA                 179
#define SSP2STAT_DATA_ADDRESS         180
#define SSP2STAT_nADDRESS             181
#define nA2                           182
#define DA2                           183
#define nADDRESS2                     184
#define D_nA2                         185
#define SSP2STAT_nA                   186
#define SSP2STAT_D_A                  187
#define SSP2STAT_CKE                  188
#define CKE2                          189
#define SSP2STAT_SMP                  190
#define SMP2                          191
#define MSK02                         192
#define SSP2ADD                       193
#define SSP2ADD_MSK0                  194
#define MSK12                         195
#define SSP2ADD_MSK1                  196
#define MSK22                         197
#define SSP2ADD_MSK2                  198
#define MSK32                         199
#define SSP2ADD_MSK3                  200
#define MSK42                         201
#define SSP2ADD_MSK4                  202
#define MSK52                         203
#define SSP2ADD_MSK5                  204
#define MSK62                         205
#define SSP2ADD_MSK6                  206
#define MSK72                         207
#define SSP2ADD_MSK7                  208
#define SSP2BUF                       209
#define T4CON                         210
#define T4CKPS0                       211
#define T4CKPS                        212
#define T4CKPS1                       213
#define TMR4ON                        214
#define T4OUTPS                       215
#define T4OUTPS0                      216
#define T4OUTPS1                      217
#define T4OUTPS2                      218
#define T4OUTPS3                      219
#define PR4                           220
#define TMR4                          221
#define CCP7CON                       222
#define CCP7M0                        223
#define CCP7M                         224
#define CCP7M1                        225
#define CCP7M2                        226
#define CCP7M3                        227
#define DC7B                          228
#define CCP7Y                         229
#define DC7B0                         230
#define CCP7X                         231
#define DC7B1                         232
#define CCPR7L                        233
#define CCPR7H                        234
#define CCP6CON                       235
#define CCP6M                         236
#define CCP6M0                        237
#define CCP6M1                        238
#define CCP6M2                        239
#define CCP6M3                        240
#define CCP6Y                         241
#define DC6B0                         242
#define DC6B                          243
#define DC6B1                         244
#define CCP6X                         245
#define CCPR6L                        246
#define CCPR6H                        247
#define CCP5CON                       248
#define CCP5M0                        249
#define CCP5M                         250
#define CCP5M1                        251
#define CCP5M2                        252
#define CCP5M3                        253
#define CCP5Y                         254
#define DC5B0                         255
#define DC5B                          256
#define CCP5X                         257
#define DC5B1                         258
#define CCPR5L                        259
#define CCPR5H                        260
#define CCP4CON                       261
#define CCP4M                         262
#define CCP4M0                        263
#define CCP4M1                        264
#define CCP4M2                        265
#define CCP4M3                        266
#define CCP4Y                         267
#define DC4B0                         268
#define DC4B                          269
#define CCP4X                         270
#define DC4B1                         271
#define CCPR4L                        272
#define CCPR4H                        273
#define T5GCON                        274
#define T5GSS                         275
#define T5GSS0                        276
#define T5GSS1                        277
#define T5GVAL                        278
#define T5GGO_NOT_T5DONE              279
#define nT5DONE                       280
#define T5GGO_nT5DONE                 281
#define NOT_T5DONE                    282
#define T5GGO                         283
#define T5GSPM                        284
#define T5GTM                         285
#define T5GPOL                        286
#define TMR5GE                        287
#define T5CON                         288
#define TMR5ON                        289
#define T5CON_RD16                    290
#define RD165                         291
#define nT5SYNC                       292
#define NOT_T5SYNC                    293
#define SOSCEN5                       294
#define T5CON_SOSCEN                  295
#define T5CKPS                        296
#define T5CKPS0                       297
#define T5CKPS1                       298
#define TMR5CS0                       299
#define TMR5CS                        300
#define TMR5CS1                       301
#define TMR5L                         302
#define TMR5H                         303
#define PMD3                          304
#define TMR12MD                       305
#define CCP4MD                        306
#define CCP5MD                        307
#define CCP6MD                        308
#define CCP7MD                        309
#define CCP8MD                        310
#define CCP9MD                        311
#define CCP10MD                       312
#define PMD2                          313
#define CMP1MD                        314
#define CMP2MD                        315
#define CMP3MD                        316
#define TMR5MD                        317
#define TMR6MD                        318
#define TMR7MD                        319
#define TMR8MD                        320
#define TMR10MD                       321
#define PMD1                          322
#define TMR1MD                        323
#define TMR2MD                        324
#define TMR3MD                        325
#define TMR4MD                        326
#define RTCCMD                        327
#define CTMUMD                        328
#define PMD0                          329
#define ADCMD                         330
#define SSP1MD                        331
#define SPI1MD                        332
#define SPI2MD                        333
#define SSP2MD                        334
#define UART1MD                       335
#define UART2MD                       336
#define CCP1MD                        337
#define CCP2MD                        338
#define CCP3MD                        339
#define PSTR3CON                      340
#define PSTR3CON_STRA                 341
#define STRA3                         342
#define STRB3                         343
#define PSTR3CON_STRB                 344
#define PSTR3CON_STRC                 345
#define STRC3                         346
#define STRD3                         347
#define PSTR3CON_STRD                 348
#define STRSYNC3                      349
#define PSTR3CON_STRSYNC              350
#define PSTR3CON_CMPL0                351
#define CMPL03                        352
#define PSTR3CON_CMPL                 353
#define CMPL13                        354
#define PSTR3CON_CMPL1                355
#define PSTR2CON                      356
#define PSTR2CON_STRA                 357
#define P2DC02                        358
#define STRA2                         359
#define P2DC0CON                      360
#define STRB2                         361
#define P2DC12                        362
#define PSTR2CON_STRB                 363
#define P2DC1CON                      364
#define STRC2                         365
#define PSTR2CON_STRC                 366
#define P2DC22                        367
#define P2DC2CON                      368
#define P2DC32                        369
#define STRD2                         370
#define PSTR2CON_STRD                 371
#define P2DC3CON                      372
#define P2DC4CON                      373
#define STRSYNC2                      374
#define PSTR2CON_STRSYNC              375
#define P2DC42                        376
#define P2DC6CON                      377
#define PSTR2CON_CMPL                 378
#define CMPL02                        379
#define P2DC62                        380
#define PSTR2CON_CMPL0                381
#define CMPL12                        382
#define PSTR2CON_CMPL1                383
#define TXREG2                        384
#define RCREG2                        385
#define SPBRG2                        386
#define SPBRGH2                       387
#define BAUDCON2                      388
#define ABDEN2                        389
#define BAUDCON2_ABDEN                390
#define WUE2                          391
#define BAUDCON2_WUE                  392
#define BRG162                        393
#define BAUDCON2_BRG16                394
#define SCKP2                         395
#define TXCKP2                        396
#define BAUDCON2_TXCKP                397
#define DTRXP2                        398
#define RXDTP2                        399
#define BAUDCON2_RXDTP                400
#define RCMT2                         401
#define RCIDL2                        402
#define BAUDCON2_RCIDL                403
#define BAUDCON2_ABDOVF               404
#define ABDOVF2                       405
#define TXSTA2                        406
#define TX9D2                         407
#define TXSTA2_TX9D                   408
#define TXD82                         409
#define TRMT2                         410
#define TXSTA2_TRMT                   411
#define BRGH2                         412
#define TXSTA2_BRGH                   413
#define SENDB2                        414
#define TXSTA2_SENDB                  415
#define TXSTA2_SYNC                   416
#define SYNC2                         417
#define TXEN2                         418
#define TXSTA2_TXEN                   419
#define TX8_92                        420
#define TX92                          421
#define TXSTA2_TX9                    422
#define TXSTA2_CSRC                   423
#define CSRC2                         424
#define RCSTA2                        425
#define RCD82                         426
#define RX9D2                         427
#define RCSTA2_RX9D                   428
#define OERR2                         429
#define RCSTA2_OERR                   430
#define FERR2                         431
#define RCSTA2_FERR                   432
#define ADDEN2                        433
#define RCSTA2_ADDEN                  434
#define RCSTA2_CREN                   435
#define CREN2                         436
#define SREN2                         437
#define RCSTA2_SREN                   438
#define RC92                          439
#define RC8_92                        440
#define RCSTA2_RX9                    441
#define RX92                          442
#define RCSTA2_SPEN                   443
#define SPEN2                         444
#define ANCON2                        445
#define PCFG16                        446
#define ANSEL16                       447
#define PCFG17                        448
#define ANSEL17                       449
#define PCFG18                        450
#define ANSEL18                       451
#define PCFG19                        452
#define ANSEL19                       453
#define ANSEL20                       454
#define PCFG20                        455
#define ANSEL21                       456
#define PCFG21                        457
#define ANSEL22                       458
#define PCFG22                        459
#define ANSEL23                       460
#define PCFG23                        461
#define ANCON1                        462
#define ANSEL8                        463
#define PCFG8                         464
#define ANSEL9                        465
#define PCFG9                         466
#define PCFG10                        467
#define ANSEL10                       468
#define ANSEL11                       469
#define PCFG11                        470
#define PCFG12                        471
#define ANSEL12                       472
#define PCFG13                        473
#define ANSEL13                       474
#define PCFG14                        475
#define ANSEL14                       476
#define PCFG15                        477
#define ANSEL15                       478
#define ANCON0                        479
#define ANSEL0                        480
#define PCFG0                         481
#define ANSEL1                        482
#define PCFG1                         483
#define ANSEL2                        484
#define PCFG2                         485
#define ANSEL3                        486
#define PCFG3                         487
#define ANSEL4                        488
#define PCFG4                         489
#define ANSEL5                        490
#define PCFG5                         491
#define ANSEL6                        492
#define PCFG6                         493
#define ANSEL7                        494
#define PCFG7                         495
#define ODCON3                        496
#define CTMUDS                        497
#define U1OD                          498
#define U2OD                          499
#define ODCON2                        500
#define CCP3OD                        501
#define CCP4OD                        502
#define CCP5OD                        503
#define CCP6OD                        504
#define CCP7OD                        505
#define CCP8OD                        506
#define CCP9OD                        507
#define CCP10OD                       508
#define ODCON1                        509
#define SPI2OD                        510
#define CCP1OD                        511
#define CCP2OD                        512
#define SPI1OD                        513
#define REFOCON                       514
#define RODIV0                        515
#define RODIV                         516
#define RODIV1                        517
#define RODIV2                        518
#define RODIV3                        519
#define ROSEL                         520
#define ROSSLP                        521
