tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86k90_tdd.h
#define ROON                          522
#define CCPTMRS2                      523
#define C8TSEL0                       524
#define C8TSEL                        525
#define C8TSEL1                       526
#define C9TSEL0                       527
#define C10TSEL0                      528
#define CCPTMRS1                      529
#define C4TSEL                        530
#define C4TSEL0                       531
#define C4TSEL1                       532
#define C5TSEL0                       533
#define C6TSEL0                       534
#define C7TSEL                        535
#define C7TSEL0                       536
#define C7TSEL1                       537
#define CCPTMRS0                      538
#define C1TSEL0                       539
#define C1TSEL                        540
#define C1TSEL1                       541
#define C1TSEL2                       542
#define C2TSEL0                       543
#define C2TSEL                        544
#define C2TSEL1                       545
#define C2TSEL2                       546
#define C3TSEL0                       547
#define C3TSEL                        548
#define C3TSEL1                       549
#define CM3CON                        550
#define CM3CON_CCH                    551
#define CCH03                         552
#define CM3CON_CCH0                   553
#define CCH13                         554
#define CM3CON_CCH1                   555
#define CM3CON_CREF                   556
#define CREF3                         557
#define CM3CON_EVPOL                  558
#define EVPOL03                       559
#define CM3CON_EVPOL0                 560
#define CM3CON_EVPOL1                 561
#define EVPOL13                       562
#define CM3CON_CPOL                   563
#define CPOL3                         564
#define COE3                          565
#define CM3CON_COE                    566
#define CM3CON_CON                    567
#define CON3                          568
#define CM2CON                        569
#define CM2CON_CCH                    570
#define CM2CON_CCH0                   571
#define CCH02                         572
#define CCH12                         573
#define CM2CON_CCH1                   574
#define CM2CON_CREF                   575
#define CREF2                         576
#define CM2CON_EVPOL                  577
#define EVPOL02                       578
#define CM2CON_EVPOL0                 579
#define EVPOL12                       580
#define CM2CON_EVPOL1                 581
#define CM2CON_CPOL                   582
#define CPOL2                         583
#define CM2CON_COE                    584
#define COE2                          585
#define CM2CON_CON                    586
#define CON2                          587
#define T12CON                        588
#define T12CKPS0                      589
#define T12CKPS                       590
#define T12CKPS1                      591
#define TMR12ON                       592
#define T12OUTPS0                     593
#define T12OUTPS                      594
#define T12OUTPS1                     595
#define T12OUTPS2                     596
#define T12OUTPS3                     597
#define PR12                          598
#define TMR12                         599
#define T10CON                        600
#define T10CKPS                       601
#define T10CKPS0                      602
#define T10CKPS1                      603
#define TMR10ON                       604
#define T10OUTPS0                     605
#define T10OUTPS                      606
#define T10OUTPS1                     607
#define T10OUTPS2                     608
#define T10OUTPS3                     609
#define PR10                          610
#define TMR10                         611
#define T8CON                         612
#define T8CKPS0                       613
#define T8CKPS                        614
#define T8CKPS1                       615
#define TMR8ON                        616
#define T8OUTPS                       617
#define T8OUTPS0                      618
#define T8OUTPS1                      619
#define T8OUTPS2                      620
#define T8OUTPS3                      621
#define PR8                           622
#define TMR8                          623
#define T6CON                         624
#define T6CKPS0                       625
#define T6CKPS                        626
#define T6CKPS1                       627
#define TMR6ON                        628
#define T6OUTPS0                      629
#define T6OUTPS                       630
#define T6OUTPS1                      631
#define T6OUTPS2                      632
#define T6OUTPS3                      633
#define PR6                           634
#define TMR6                          635
#define T7GCON                        636
#define T7GSS0                        637
#define T7GSS                         638
#define T7GSS1                        639
#define T7GVAL                        640
#define nT7DONE                       641
#define T7GGO_NOT_T7DONE              642
#define NOT_T7DONE                    643
#define T7GGO_nT7DONE                 644
#define T7GGO                         645
#define T7GSPM                        646
#define T7GTM                         647
#define T7GPOL                        648
#define TMR7GE                        649
#define T7CON                         650
#define TMR7ON                        651
#define T7CON_RD16                    652
#define RD167                         653
#define nT7SYNC                       654
#define NOT_T7SYNC                    655
#define SOSCEN7                       656
#define T7CON_SOSCEN                  657
#define T7CKPS                        658
#define T7CKPS0                       659
#define T7CKPS1                       660
#define TMR7CS                        661
#define TMR7CS0                       662
#define TMR7CS1                       663
#define TMR7L                         664
#define CAL07                         665
#define CAL17                         666
#define CAL27                         667
#define CAL37                         668
#define CAL47                         669
#define CAL57                         670
#define CAL67                         671
#define CAL77                         672
#define TMR7H                         673
#define CCP10CON                      674
#define CCP10M                        675
#define CCP10M0                       676
#define CCP10M1                       677
#define CCP10M2                       678
#define CCP10M3                       679
#define CCP10Y                        680
#define DC10B0                        681
#define DC10B                         682
#define CCP10X                        683
#define DC10B1                        684
#define CCPR10L                       685
#define CCPR10H                       686
#define CCP9CON                       687
#define CCP9M0                        688
#define CCP9M                         689
#define CCP9M1                        690
#define CCP9M2                        691
#define CCP9M3                        692
#define CCP9Y                         693
#define DC9B0                         694
#define DC9B                          695
#define CCP9X                         696
#define DC9B1                         697
#define CCPR9L                        698
#define CCPR9H                        699
#define CCP8CON                       700
#define CCP8M0                        701
#define CCP8M                         702
#define CCP8M1                        703
#define CCP8M2                        704
#define CCP8M3                        705
#define DC8B0                         706
#define CCP8Y                         707
#define DC8B                          708
#define DC8B1                         709
#define CCP8X                         710
#define CCPR8L                        711
#define CCPR8H                        712
#define CCP3CON                       713
#define CCP3M                         714
#define CCP3M0                        715
#define CCP3M1                        716
#define CCP3M2                        717
#define CCP3M3                        718
#define CCP3Y                         719
#define DC3B                          720
#define DC3B0                         721
#define DC3B1                         722
#define CCP3X                         723
#define P3M                           724
#define P3M0                          725
#define P3M1                          726
#define CCPR3L                        727
#define CCPR3H                        728
#define ECCP3DEL                      729
#define P3DC                          730
#define P3DC0                         731
#define P3DC1                         732
#define P3DC2                         733
#define P3DC3                         734
#define P3DC4                         735
#define P3DC5                         736
#define P3DC6                         737
#define P3RSEN                        738
#define PSS3BD0                       739
#define PSS3BD                        740
#define PSS3BD1                       741
#define PSS3AC0                       742
#define PSS3AC                        743
#define PSS3AC1                       744
#define ECCP3AS                       745
#define ECCP3AS0                      746
#define ECCP3AS1                      747
#define ECCP3AS2                      748
#define ECCP3ASE                      749
#define CCP2CON                       750
#define CCP2M                         751
#define CCP2M0                        752
#define CCP2M1                        753
#define CCP2M2                        754
#define CCP2M3                        755
#define DC2B                          756
#define DC2B0                         757
#define CCP2Y                         758
#define DC2B1                         759
#define CCP2X                         760
#define P2M                           761
#define P2M0                          762
#define P2M1                          763
#define CCPR2L                        764
#define CCPR2H                        765
#define ECCP2DEL                      766
#define P2DC                          767
#define P2DC0                         768
#define P2DC1                         769
#define P2DC2                         770
#define P2DC3                         771
#define P2DC4                         772
#define P2DC5                         773
#define P2DC6                         774
#define P2RSEN                        775
#define PSS2BD                        776
#define PSS2BD0                       777
#define PSS2BD1                       778
#define PSS2AC0                       779
#define PSS2AC                        780
#define PSS2AC1                       781
#define ECCP2AS0                      782
#define ECCP2AS                       783
#define ECCP2AS1                      784
#define ECCP2AS2                      785
#define ECCP2ASE                      786
#define PADCFG1                       787
#define RTSECSEL0                     788
#define RTSECSEL                      789
#define RTSECSEL1                     790
#define PADCFG1_RJPU                  791
#define REPU                          792
#define RDPU                          793
#define CM1CON                        794
#define CM1CON_CCH                    795
#define C1CH0                         796
#define CM1CON_CCH0                   797
#define CCH01                         798
#define CCH11                         799
#define C1CH1                         800
#define CM1CON_CCH1                   801
#define CM1CON_CREF                   802
#define CREF1                         803
#define EVPOL01                       804
#define CM1CON_EVPOL0                 805
#define CM1CON_EVPOL                  806
#define CM1CON_EVPOL1                 807
#define EVPOL11                       808
#define CM1CON_CPOL                   809
#define CPOL1                         810
#define CM1CON_COE                    811
#define COE1                          812
#define CM1CON_CON                    813
#define CON1                          814
#define CTMUICON                      815
#define IRNG                          816
#define IRNG0                         817
#define IRNG1                         818
#define ITRIM0                        819
#define ITRIM                         820
#define ITRIM1                        821
#define ITRIM2                        822
#define ITRIM3                        823
#define ITRIM4                        824
#define ITRIM5                        825
#define CTMUCONL                      826
#define EDG1STAT                      827
#define EDG2STAT                      828
#define EDG1SEL                       829
#define EDG1SEL0                      830
#define EDG1SEL1                      831
#define EDG1POL                       832
#define EDG2SEL0                      833
#define EDG2SEL                       834
#define EDG2SEL1                      835
#define EDG2POL                       836
#define CTMUCONH                      837
#define CTTRIG                        838
#define IDISSEN                       839
#define EDGSEQEN                      840
#define EDGEN                         841
#define TGEN                          842
#define CTMUSIDL                      843
#define CTMUEN                        844
#define ALRMVALL                      845
#define ALRMVALH                      846
#define ALRMRPT                       847
#define ARPT0                         848
#define ARPT                          849
#define ARPT1                         850
#define ARPT2                         851
#define ARPT3                         852
#define ARPT4                         853
#define ARPT5                         854
#define ARPT6                         855
#define ARPT7                         856
#define ALRMCFG                       857
#define ALRMPTR                       858
#define ALRMPTR0                      859
#define ALRMPTR1                      860
#define AMASK0                        861
#define AMASK                         862
#define AMASK1                        863
#define AMASK2                        864
#define AMASK3                        865
#define CHIME                         866
#define ALRMEN                        867
#define RTCVALL                       868
#define WAITE0                        869
#define RTCVALH                       870
#define WAITE1                        871
#define WAITM0                        872
#define WAITM1                        873
#define WAITM2                        874
#define WAITM3                        875
#define WAITB0                        876
#define WAITB1                        877
#define RTCCAL                        878
#define CAL0                          879
#define CAL                           880
#define CAL1                          881
#define CAL2                          882
#define CAL3                          883
#define CAL4                          884
#define CAL5                          885
#define CAL6                          886
#define CAL7                          887
#define RTCCFG                        888
#define RTCPTR0                       889
#define RTCPTR                        890
#define RTCPTR1                       891
#define RTCOE                         892
#define HALFSEC                       893
#define RTCSYNC                       894
#define RTCWREN                       895
#define RTCEN                         896
#define PIE6                          897
#define CMP1IE                        898
#define CMP2IE                        899
#define CMP3IE                        900
#define EEIE                          901
#define EEDATA                        902
#define EEADR                         903
#define EEADRH                        904
#define OSCCON2                       905
#define MFIOSEL                       906
#define MFIOFS                        907
#define SOSCGO                        908
#define SOSCRUN                       909
#define BAUDCON1                      910
#define BAUDCON1_ABDEN                911
#define ABDEN1                        912
#define BAUDCON1_WUE                  913
#define WUE1                          914
#define W4E                           915
#define BRG161                        916
#define BAUDCON1_BRG16                917
#define CKTXP                         918
#define BAUDCON1_TXCKP                919
#define SCKP1                         920
#define TXCKP1                        921
#define SCKP                          922
#define DTRXP1                        923
#define RXDTP1                        924
#define DTRXP                         925
#define RXCKP                         926
#define BAUDCON1_RXDTP                927
#define RCMT1                         928
#define RCIDL1                        929
#define BAUDCON1_RCIDL                930
#define RCMT                          931
#define ABDOVF1                       932
#define BAUDCON1_ABDOVF               933
#define LCDDATA0                      934
#define S00C0                         935
#define S01C0                         936
#define S02C0                         937
#define S03C0                         938
#define S04C0                         939
#define S05C0                         940
#define S06C0                         941
#define S07C0                         942
#define LCDDATA1                      943
#define S08C0                         944
#define S09C0                         945
#define S10C0                         946
#define S11C0                         947
#define S12C0                         948
#define S13C0                         949
#define S14C0                         950
#define S15C0                         951
#define LCDDATA2                      952
#define S16C0                         953
#define S17C0                         954
#define S18C0                         955
#define S19C0                         956
#define S20C0                         957
#define S21C0                         958
#define S22C0                         959
#define S23C0                         960
#define LCDDATA3                      961
#define S24C0                         962
#define S25C0                         963
#define S26C0                         964
#define S27C0                         965
#define S28C0                         966
#define S29C0                         967
#define S30C0                         968
#define S31C0                         969
#define LCDDATA4                      970
#define S32C0                         971
#define S33C0                         972
#define S34C0                         973
#define S35C0                         974
#define S36C0                         975
#define S37C0                         976
#define S38C0                         977
#define S39C0                         978
#define LCDDATA5                      979
#define S40C0                         980
#define S40C15                        981
#define S41C0                         982
#define S42C0                         983
#define S43C0                         984
#define S44C0                         985
#define S45C0                         986
#define S46C0                         987
#define S47C0                         988
#define LCDDATA6                      989
#define S00C1                         990
#define S01C1                         991
#define S02C1                         992
#define S03C1                         993
#define S04C1                         994
#define S05C1                         995
#define S06C1                         996
#define S07C1                         997
#define LCDDATA7                      998
#define S08C1                         999
#define S09C1                         1000
#define S10C1                         1001
#define S11C1                         1002
#define S12C1                         1003
#define S13C1                         1004
#define S14C1                         1005
#define S15C1                         1006
#define LCDDATA8                      1007
#define S16C1                         1008
#define S17C1                         1009
#define S18C1                         1010
#define S19C1                         1011
#define S20C1                         1012
#define S21C1                         1013
#define S22C1                         1014
#define S23C1                         1015
#define LCDDATA9                      1016
#define S24C1                         1017
#define S25C1                         1018
#define S26C1                         1019
#define S27C1                         1020
#define S28C1                         1021
#define S29C1                         1022
#define S30C1                         1023
#define S31C1                         1024
#define LCDDATA10                     1025
#define S32C1                         1026
#define S33C1                         1027
#define S34C1                         1028
#define S35C1                         1029
#define S36C1                         1030
#define S37C1                         1031
#define S38C1                         1032
#define S39C1                         1033
#define LCDDATA11                     1034
#define S40C1                         1035
#define LCDDATA11_ADMSK1              1036
#define S41C1                         1037
#define S42C1                         1038
#define LCDDATA11_ADMSK2              1039
#define LCDDATA11_ADMSK3              1040
#define S43C1                         1041
#define LCDDATA11_ADMSK4              1042
#define S44C1                         1043
#define LCDDATA11_ADMSK5              1044
#define S45C1                         1045
#define S46C1                         1046
#define S47C1                         1047
#define LCDDATA12                     1048
#define SSPM012                       1049
#define S00C2                         1050
#define S01C2                         1051
#define SSPM112                       1052
#define SSPM212                       1053
#define S02C2                         1054
#define S03C2                         1055
#define SSPM312                       1056
#define S04C2                         1057
#define S05C2                         1058
#define S06C2                         1059
#define S07C2                         1060
#define LCDDATA13                     1061
#define S08C2                         1062
#define S09C2                         1063
#define S10C2                         1064
#define S11C2                         1065
#define S12C2                         1066
#define S13C2                         1067
#define S14C2                         1068
#define S15C2                         1069
#define LCDDATA14                     1070
#define LCDDATA14_MSK0                1071
#define S16C2                         1072
#define LCDDATA14_MSK1                1073
#define S17C2                         1074
#define LCDDATA14_MSK2                1075
#define S18C2                         1076
#define S19C2                         1077
#define LCDDATA14_MSK3                1078
#define LCDDATA14_MSK4                1079
#define S20C2                         1080
#define LCDDATA14_MSK5                1081
#define S21C2                         1082
#define LCDDATA14_MSK6                1083
#define S22C2                         1084
#define LCDDATA14_MSK7                1085
#define S23C2                         1086
#define LCDDATA15                     1087
#define S24C2                         1088
#define S25C2                         1089
#define S26C2                         1090
