tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86k90_tdd.h
#define S27C2                         1091
#define S28C2                         1092
#define S29C2                         1093
#define S30C2                         1094
#define S31C2                         1095
#define LCDDATA16                     1096
#define S32C2                         1097
#define T4CKPS016                     1098
#define T4CKPS116                     1099
#define S33C2                         1100
#define S34C2                         1101
#define T4OUTPS016                    1102
#define S35C2                         1103
#define S36C2                         1104
#define T4OUTPS116                    1105
#define T4OUTPS216                    1106
#define S37C2                         1107
#define S38C2                         1108
#define T4OUTPS316                    1109
#define S39C2                         1110
#define LCDDATA17                     1111
#define S40C2                         1112
#define S41C2                         1113
#define S42C2                         1114
#define S43C2                         1115
#define S44C2                         1116
#define S45C2                         1117
#define S46C2                         1118
#define S47C2                         1119
#define LCDDATA18                     1120
#define S00C3                         1121
#define S01C3                         1122
#define S02C3                         1123
#define S03C3                         1124
#define S04C3                         1125
#define S05C3                         1126
#define S06C3                         1127
#define S07C3                         1128
#define LCDDATA19                     1129
#define S08C3                         1130
#define S09C3                         1131
#define S10C3                         1132
#define S11C3                         1133
#define S12C3                         1134
#define T3CKPS019                     1135
#define T3CKPS119                     1136
#define S13C3                         1137
#define S14C3                         1138
#define TMR3CS019                     1139
#define TMR3CS119                     1140
#define S15C3                         1141
#define LCDDATA20                     1142
#define S16C3                         1143
#define S17C3                         1144
#define S18C3                         1145
#define S19C3                         1146
#define S20C3                         1147
#define S21C3                         1148
#define S22C3                         1149
#define S23C3                         1150
#define LCDDATA21                     1151
#define S24C3                         1152
#define S25C3                         1153
#define S26C3                         1154
#define S27C3                         1155
#define S28C3                         1156
#define S29C3                         1157
#define S30C3                         1158
#define S31C3                         1159
#define LCDDATA22                     1160
#define S32C3                         1161
#define S33C3                         1162
#define S34C3                         1163
#define S35C3                         1164
#define S36C3                         1165
#define S37C3                         1166
#define S38C3                         1167
#define S39C3                         1168
#define LCDDATA23                     1169
#define S40C3                         1170
#define S41C3                         1171
#define S42C3                         1172
#define S43C3                         1173
#define S44C3                         1174
#define S45C3                         1175
#define S46C3                         1176
#define S47C3                         1177
#define EECON2                        1178
#define EECON1                        1179
#define EECON1_RD                     1180
#define EECON1_WR                     1181
#define WREN                          1182
#define WRERR                         1183
#define FREE                          1184
#define CFGS                          1185
#define EEFS                          1186
#define EEPGD                         1187
#define PORTA                         1188
#define ULPWUIN                       1189
#define AN0                           1190
#define RA0                           1191
#define SEG18                         1192
#define AN1                           1193
#define RA1                           1194
#define AN2                           1195
#define RA2                           1196
#define VREF_MINUS                    1197
#define AN3                           1198
#define VREF_PLUS                     1199
#define RA3                           1200
#define SEG14                         1201
#define T0CKI                         1202
#define RA4                           1203
#define SEG15                         1204
#define AN4                           1205
#define T1CKI                         1206
#define LVDIN                         1207
#define RA5                           1208
#define T3G                           1209
#define CLKO                          1210
#define RA6                           1211
#define OSC2                          1212
#define CLKI                          1213
#define PORTA_RJPU                    1214
#define RA7                           1215
#define OSC1                          1216
#define PORTB                         1217
#define SEG30                         1218
#define FLT0                          1219
#define RB0                           1220
#define INT0                          1221
#define RB1                           1222
#define INT1                          1223
#define SEG8                          1224
#define RB2                           1225
#define INT2                          1226
#define CTED1                         1227
#define SEG9                          1228
#define SEG10                         1229
#define RB3                           1230
#define INT3                          1231
#define CCP2_PA2                      1232
#define CTED2                         1233
#define SEG11                         1234
#define RB4                           1235
#define KBI0                          1236
#define PGM                           1237
#define T3CKI                         1238
#define RB5                           1239
#define SEG29                         1240
#define KBI1                          1241
#define T1G                           1242
#define PGC                           1243
#define RB6                           1244
#define KBI2                          1245
#define PGD                           1246
#define RB7                           1247
#define KBI3                          1248
#define PORTC                         1249
#define SCKLI                         1250
#define RC0                           1251
#define SOSCO                         1252
#define SEG32                         1253
#define PORTC_PA2                     1254
#define PORTC_CCP2                    1255
#define RC1                           1256
#define SOSCI                         1257
#define SEG13                         1258
#define CCP1                          1259
#define PA1                           1260
#define RC2                           1261
#define SEG17                         1262
#define SCK1                          1263
#define SCL1                          1264
#define RC3                           1265
#define SEG16                         1266
#define SDI1                          1267
#define SDA1                          1268
#define RC4                           1269
#define SEG12                         1270
#define SDO1                          1271
#define RC5                           1272
#define SEG27                         1273
#define TX1                           1274
#define RC6                           1275
#define CK1                           1276
#define DT1                           1277
#define RX1                           1278
#define SEG28                         1279
#define RC7                           1280
#define PORTD                         1281
#define PSP0                          1282
#define RD0                           1283
#define CTPLS                         1284
#define AD0                           1285
#define SEG0                          1286
#define PSP1                          1287
#define RD1                           1288
#define T5CKI                         1289
#define T7G                           1290
#define AD1                           1291
#define SEG1                          1292
#define PSP2                          1293
#define RD2                           1294
#define AD2                           1295
#define SEG2                          1296
#define PSP3                          1297
#define RD3                           1298
#define AD3                           1299
#define SEG3                          1300
#define PSP4                          1301
#define RD4                           1302
#define AD4                           1303
#define SDO2                          1304
#define SEG4                          1305
#define PSP5                          1306
#define RD5                           1307
#define SDI2                          1308
#define AD5                           1309
#define SDA2                          1310
#define SEG5                          1311
#define SEG6                          1312
#define SCK2                          1313
#define PSP6                          1314
#define RD6                           1315
#define AD6                           1316
#define SCL2                          1317
#define SS2                           1318
#define PSP7                          1319
#define RD7                           1320
#define AD7                           1321
#define SEG7                          1322
#define PORTE                         1323
#define PD2                           1324
#define AD8                           1325
#define PORTE_RD                      1326
#define RDE                           1327
#define LCDBIAS1                      1328
#define RE0                           1329
#define AD9                           1330
#define PORTE_WR                      1331
#define WRE                           1332
#define LCDBIAS2                      1333
#define RE1                           1334
#define PC2                           1335
#define PORTE_CS                      1336
#define PB2                           1337
#define CCP10                         1338
#define AD10                          1339
#define LCDBIAS3                      1340
#define RE2                           1341
#define PORTE_CCP9                    1342
#define COM0                          1343
#define PORTE_PC3                     1344
#define CCP9E                         1345
#define AD11                          1346
#define RE3                           1347
#define PC3E                          1348
#define PORTE_CCP8                    1349
#define PB3E                          1350
#define COM1                          1351
#define PORTE_PB3                     1352
#define REFO                          1353
#define AD12                          1354
#define RE4                           1355
#define CCP8E                         1356
#define PORTE_CCP7                    1357
#define COM2                          1358
#define PORTE_PC1                     1359
#define CCP7E                         1360
#define AD13                          1361
#define RE5                           1362
#define PC1E                          1363
#define PORTE_CCP6                    1364
#define CCP6E                         1365
#define COM3                          1366
#define AD14                          1367
#define RE6                           1368
#define PB1E                          1369
#define PORTE_PB1                     1370
#define PORTE_CCP2                    1371
#define CCP2E                         1372
#define SEG31                         1373
#define PA2E                          1374
#define PORTE_PA2                     1375
#define AD15                          1376
#define RE7                           1377
#define PORTF                         1378
#define SEG19                         1379
#define C2OUTF                        1380
#define AN6                           1381
#define PORTF_C2OUT                   1382
#define RF1                           1383
#define CTDIN                         1384
#define PORTF_C1OUT                   1385
#define AN7                           1386
#define RF2                           1387
#define C1OUTF                        1388
#define SEG20                         1389
#define AN8                           1390
#define RF3                           1391
#define SEG21                         1392
#define CTMUI                         1393
#define C2INB                         1394
#define AN9                           1395
#define RF4                           1396
#define SEG22                         1397
#define C2INA                         1398
#define C1INB                         1399
#define RF5                           1400
#define SEG23                         1401
#define CVREF                         1402
#define AN10                          1403
#define C1INA                         1404
#define RF6                           1405
#define SEG24                         1406
#define AN11                          1407
#define SS1                           1408
#define AN5                           1409
#define RF7                           1410
#define SEG25                         1411
#define PORTG                         1412
#define CCP3                          1413
#define PA3                           1414
#define RG0                           1415
#define C3OUTG                        1416
#define PORTG_C3OUT                   1417
#define TX2                           1418
#define RG1                           1419
#define CK2                           1420
#define AN19                          1421
#define C3INA                         1422
#define RX2                           1423
#define RG2                           1424
#define DT2                           1425
#define AN18                          1426
#define CCP4                          1427
#define PD3                           1428
#define C3INB                         1429
#define RG3                           1430
#define AN17                          1431
#define CCP5                          1432
#define PD1                           1433
#define SEG26                         1434
#define C3INC                         1435
#define T7CKI                         1436
#define T5G                           1437
#define RG4                           1438
#define RTCC                          1439
#define AN16                          1440
#define PORTG_RJPU                    1441
#define RG5                           1442
#define PORTH                         1443
#define RH0                           1444
#define A16                           1445
#define SEG47                         1446
#define AN23                          1447
#define RH1                           1448
#define A17                           1449
#define SEG46                         1450
#define AN22                          1451
#define RH2                           1452
#define A18                           1453
#define SEG45                         1454
#define AN21                          1455
#define RH3                           1456
#define A19                           1457
#define SEG44                         1458
#define AN20                          1459
#define PORTH_CCP9                    1460
#define RH4                           1461
#define SEG40                         1462
#define C2INC                         1463
#define PORTH_PC3                     1464
#define AN12                          1465
#define PORTH_CCP8                    1466
#define RH5                           1467
#define SEG41                         1468
#define PORTH_PB3                     1469
#define AN13                          1470
#define C2IND                         1471
#define C1INC                         1472
#define RH6                           1473
#define SEG42                         1474
#define PORTH_CCP7                    1475
#define PORTH_PC1                     1476
#define AN14                          1477
#define RH7                           1478
#define PORTH_CCP6                    1479
#define SEG43                         1480
#define PORTH_PB1                     1481
#define AN15                          1482
#define PORTJ                         1483
#define RJ0                           1484
#define ALE                           1485
#define RJ1                           1486
#define SEG33                         1487
#define OE                            1488
#define RJ2                           1489
#define SEG34                         1490
#define WRL                           1491
#define RJ3                           1492
#define SEG35                         1493
#define WRH                           1494
#define RJ4                           1495
#define SEG39                         1496
#define BA0                           1497
#define RJ5                           1498
#define SEG38                         1499
#define CE                            1500
#define RJ6                           1501
#define SEG37                         1502
#define LB                            1503
#define RJ7                           1504
#define SEG36                         1505
#define UB                            1506
#define LATA                          1507
#define LATA0                         1508
#define LA0                           1509
#define LATA1                         1510
#define LA1                           1511
#define LATA2                         1512
#define LA2                           1513
#define LATA3                         1514
#define LA3                           1515
#define LATA4                         1516
#define LA4                           1517
#define LATA5                         1518
#define LA5                           1519
#define LATA6                         1520
#define LA6                           1521
#define LATA7                         1522
#define LA7                           1523
#define LATB                          1524
#define LB0                           1525
#define LATB0                         1526
#define LB1                           1527
#define LATB1                         1528
#define LB2                           1529
#define LATB2                         1530
#define LB3                           1531
#define LATB3                         1532
#define LB4                           1533
#define LATB4                         1534
#define LB5                           1535
#define LATB5                         1536
#define LB6                           1537
#define LATB6                         1538
#define LB7                           1539
#define LATB7                         1540
#define LATC                          1541
#define LATC0                         1542
#define LC0                           1543
#define LATC1                         1544
#define LC1                           1545
#define LATC2                         1546
#define LC2                           1547
#define LATC3                         1548
#define LC3                           1549
#define LATC4                         1550
#define LC4                           1551
#define LATC5                         1552
#define LC5                           1553
#define LATC6                         1554
#define LC6                           1555
#define LATC7                         1556
#define LC7                           1557
#define LATD                          1558
#define LATD0                         1559
#define LD0                           1560
#define LATD1                         1561
#define LD1                           1562
#define LATD2                         1563
#define LD2                           1564
#define LATD3                         1565
#define LD3                           1566
#define LATD4                         1567
#define LD4                           1568
#define LATD5                         1569
#define LD5                           1570
#define LATD6                         1571
#define LD6                           1572
#define LATD7                         1573
#define LD7                           1574
#define LATE                          1575
#define LATE0                         1576
#define LE0                           1577
#define LATE1                         1578
#define LE1                           1579
#define LATE2                         1580
#define LE2                           1581
#define LATE3                         1582
#define LE3                           1583
#define LATE4                         1584
#define LE4                           1585
#define LATE5                         1586
#define LE5                           1587
#define LATE6                         1588
#define LE6                           1589
#define LATE7                         1590
#define LE7                           1591
#define LATF                          1592
#define LATF1                         1593
#define LF1                           1594
#define LF2                           1595
#define LATF2                         1596
#define LF3                           1597
#define LATF3                         1598
#define LF4                           1599
#define LATF4                         1600
#define LF5                           1601
#define LATF5                         1602
#define LF6                           1603
#define LATF6                         1604
#define LF7                           1605
#define LATF7                         1606
#define LATG                          1607
#define LATG0                         1608
#define LG0                           1609
#define LATG1                         1610
#define LG1                           1611
#define LATG2                         1612
#define LG2                           1613
#define LATG3                         1614
#define LG3                           1615
#define LATG4                         1616
#define LG4                           1617
#define LATH                          1618
#define LH0                           1619
#define LATH0                         1620
#define LH1                           1621
#define LATH1                         1622
#define LH2                           1623
#define LATH2                         1624
#define LH3                           1625
#define LATH3                         1626
#define LH4                           1627
#define LATH4                         1628
#define LH5                           1629
#define LATH5                         1630
#define LH6                           1631
#define LATH6                         1632
#define LH7                           1633
#define LATH7                         1634
#define LATJ                          1635
#define LATJ0                         1636
#define LJ0                           1637
#define LATJ1                         1638
#define LJ1                           1639
#define LATJ2                         1640
#define LJ2                           1641
#define LATJ3                         1642
#define LJ3                           1643
#define LATJ4                         1644
#define LJ4                           1645
#define LATJ5                         1646
#define LJ5                           1647
#define LATJ6                         1648
