tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86k90_tdd.h
#define LJ6                           1649
#define LATJ7                         1650
#define LJ7                           1651
#define TRISA                         1652
#define TRISA0                        1653
#define TRISA1                        1654
#define TRISA2                        1655
#define TRISA3                        1656
#define TRISA4                        1657
#define TRISA5                        1658
#define TRISA6                        1659
#define TRISA7                        1660
#define TRISB                         1661
#define TRISB0                        1662
#define TRISB1                        1663
#define TRISB2                        1664
#define TRISB3                        1665
#define TRISB4                        1666
#define TRISB5                        1667
#define TRISB6                        1668
#define TRISB7                        1669
#define TRISC                         1670
#define TRISC0                        1671
#define TRISC1                        1672
#define TRISC2                        1673
#define TRISC3                        1674
#define TRISC4                        1675
#define TRISC5                        1676
#define TRISC6                        1677
#define TRISC7                        1678
#define TRISD                         1679
#define TRISD0                        1680
#define TRISD1                        1681
#define TRISD2                        1682
#define TRISD3                        1683
#define TRISD4                        1684
#define TRISD5                        1685
#define TRISD6                        1686
#define TRISD7                        1687
#define TRISE                         1688
#define TRISE0                        1689
#define TRISE1                        1690
#define TRISE2                        1691
#define TRISE3                        1692
#define TRISE4                        1693
#define TRISE5                        1694
#define TRISE6                        1695
#define TRISE7                        1696
#define TRISF                         1697
#define TRISF1                        1698
#define TRISF2                        1699
#define TRISF3                        1700
#define TRISF4                        1701
#define TRISF5                        1702
#define TRISF6                        1703
#define TRISF7                        1704
#define TRISG                         1705
#define TRISG0                        1706
#define TRISG1                        1707
#define TRISG2                        1708
#define TRISG3                        1709
#define TRISG4                        1710
#define TRISH                         1711
#define TRISH0                        1712
#define TRISH1                        1713
#define TRISH2                        1714
#define TRISH3                        1715
#define TRISH4                        1716
#define TRISH5                        1717
#define TRISH6                        1718
#define TRISH7                        1719
#define TRISJ                         1720
#define TRISJ0                        1721
#define TRISJ1                        1722
#define TRISJ2                        1723
#define TRISJ3                        1724
#define TRISJ4                        1725
#define TRISJ5                        1726
#define TRISJ6                        1727
#define TRISJ7                        1728
#define OSCTUNE                       1729
#define TUN0                          1730
#define TUN                           1731
#define TUN1                          1732
#define TUN2                          1733
#define TUN3                          1734
#define TUN4                          1735
#define TUN5                          1736
#define PLLEN                         1737
#define INTSRC                        1738
#define PSTR1CON                      1739
#define PSTR1CON_STRA                 1740
#define PSTR1CON_STRB                 1741
#define PSTR1CON_STRC                 1742
#define PSTR1CON_STRD                 1743
#define PSTR1CON_STRSYNC              1744
#define PSTR1CON_CMPL0                1745
#define PSTR1CON_CMPL                 1746
#define PSTR1CON_CMPL1                1747
#define PIE1                          1748
#define TMR1IE                        1749
#define TMR2IE                        1750
#define TMR1GIE                       1751
#define SSP1IE                        1752
#define SSPIE                         1753
#define TXIE                          1754
#define TX1IE                         1755
#define RCIE                          1756
#define RC1IE                         1757
#define ADIE                          1758
#define PIR1                          1759
#define TMR1IF                        1760
#define TMR2IF                        1761
#define TMR1GIF                       1762
#define SSPIF                         1763
#define SSP1IF                        1764
#define TXIF                          1765
#define TX1IF                         1766
#define RCIF                          1767
#define RC1IF                         1768
#define ADIF                          1769
#define IPR1                          1770
#define TMR1IP                        1771
#define TMR2IP                        1772
#define TMR1GIP                       1773
#define SSPIP                         1774
#define SSP1IP                        1775
#define TX1IP                         1776
#define TXIP                          1777
#define RCIP                          1778
#define RC1IP                         1779
#define ADIP                          1780
#define PIE2                          1781
#define TMR3GIE                       1782
#define TMR3IE                        1783
#define HLVDIE                        1784
#define LVDIE                         1785
#define BCL1IE                        1786
#define BCLIE                         1787
#define BCL2IE                        1788
#define SSP2IE                        1789
#define OSCFIE                        1790
#define PIR2                          1791
#define TMR3GIF                       1792
#define TMR3IF                        1793
#define HLVDIF                        1794
#define LVDIF                         1795
#define BCLIF                         1796
#define BCL1IF                        1797
#define BCL2IF                        1798
#define SSP2IF                        1799
#define OSCFIF                        1800
#define IPR2                          1801
#define TMR3GIP                       1802
#define TMR3IP                        1803
#define HLVDIP                        1804
#define LVDIP                         1805
#define BCLIP                         1806
#define BCL1IP                        1807
#define BCL2IP                        1808
#define SSP2IP                        1809
#define OSCFIP                        1810
#define PIE3                          1811
#define RXB0IE                        1812
#define RTCCIE                        1813
#define RXBNIE                        1814
#define CCP1IE                        1815
#define RXB1IE                        1816
#define CCP2IE                        1817
#define TXB0IE                        1818
#define CTMUIE                        1819
#define TXB1IE                        1820
#define TXBNIE                        1821
#define TXB2IE                        1822
#define TX2IE                         1823
#define RC2IE                         1824
#define LCDIE                         1825
#define TMR5GIE                       1826
#define PIR3                          1827
#define RTCCIF                        1828
#define RXBNIF                        1829
#define CCP1IF                        1830
#define CCP2IF                        1831
#define CTMUIF                        1832
#define TXBNIF                        1833
#define TX2IF                         1834
#define RC2IF                         1835
#define LCDIF                         1836
#define TMR5GIF                       1837
#define IPR3                          1838
#define RTCCIP                        1839
#define CCP1IP                        1840
#define RXBNIP                        1841
#define CCP2IP                        1842
#define CTMUIP                        1843
#define TX2IP                         1844
#define TXBNIP                        1845
#define RC2IP                         1846
#define LCDIP                         1847
#define TMR5GIP                       1848
#define PIR6                          1849
#define CMP1IF                        1850
#define CMP2IF                        1851
#define CMP3IF                        1852
#define EEIF                          1853
#define HLVDCON                       1854
#define HLVDL                         1855
#define HLVDL0                        1856
#define HLVDL1                        1857
#define HLVDL2                        1858
#define HLVDL3                        1859
#define HLVDEN                        1860
#define IRVST                         1861
#define BGVST                         1862
#define VDIRMAG                       1863
#define IPR6                          1864
#define CMP1IP                        1865
#define CMP2IP                        1866
#define CMP3IP                        1867
#define EEIP                          1868
#define T1GCON                        1869
#define T1GSS0                        1870
#define T1GSS                         1871
#define T1GSS1                        1872
#define T1GVAL                        1873
#define T1GGO_nT1DONE                 1874
#define nT1DONE                       1875
#define T1GGO_NOT_T1DONE              1876
#define NOT_T1DONE                    1877
#define T1GGO                         1878
#define T1GSPM                        1879
#define T1GTM                         1880
#define T1GPOL                        1881
#define TMR1GE                        1882
#define RCSTA1                        1883
#define RCSTA1_RX9D                   1884
#define RX9D1                         1885
#define RCD8                          1886
#define RCSTA1_OERR                   1887
#define OERR1                         1888
#define RCSTA1_FERR                   1889
#define FERR1                         1890
#define RCSTA1_ADDEN                  1891
#define ADDEN1                        1892
#define ADEN                          1893
#define RCSTA1_CREN                   1894
#define CREN1                         1895
#define SRENA                         1896
#define SREN1                         1897
#define RCSTA1_SREN                   1898
#define RC8_9                         1899
#define RCSTA1_RX9                    1900
#define nRC8                          1901
#define NOT_RC8                       1902
#define RC9                           1903
#define RX91                          1904
#define RCSTA1_SPEN                   1905
#define SPEN1                         1906
#define TXSTA1                        1907
#define TX9D1                         1908
#define TXSTA1_TX9D                   1909
#define TXD8                          1910
#define TRMT1                         1911
#define TXSTA1_TRMT                   1912
#define BRGH1                         1913
#define TXSTA1_BRGH                   1914
#define TXSTA1_SENDB                  1915
#define SENDB1                        1916
#define TXSTA1_SYNC                   1917
#define SYNC1                         1918
#define TXEN1                         1919
#define TXSTA1_TXEN                   1920
#define TX91                          1921
#define TX8_9                         1922
#define NOT_TX8                       1923
#define nTX8                          1924
#define TXSTA1_TX9                    1925
#define TXSTA1_CSRC                   1926
#define CSRC1                         1927
#define TXREG1                        1928
#define RCREG1                        1929
#define SPBRG1                        1930
#define T3GCON                        1931
#define T3GSS0                        1932
#define T3GSS                         1933
#define T3GSS1                        1934
#define T3GVAL                        1935
#define T3GGO                         1936
#define NOT_T3DONE                    1937
#define nT3DONE                       1938
#define T3GGO_nT3DONE                 1939
#define T3GGO_NOT_T3DONE              1940
#define T3GSPM                        1941
#define T3GTM                         1942
#define T3GPOL                        1943
#define TMR3GE                        1944
#define T3CON                         1945
#define TMR3ON                        1946
#define T3CON_RD16                    1947
#define nT3SYNC                       1948
#define NOT_T3SYNC                    1949
#define SOSCEN3                       1950
#define T3CON_SOSCEN                  1951
#define T3CKPS0                       1952
#define T3CKPS                        1953
#define T3CKPS1                       1954
#define TMR3CS                        1955
#define TMR3CS0                       1956
#define TMR3CS1                       1957
#define T3RD16                        1958
#define RD163                         1959
#define TMR3L                         1960
#define TMR3H                         1961
#define CMSTAT                        1962
#define CMSTAT_C1OUT                  1963
#define CMP1OUT                       1964
#define CMSTAT_C2OUT                  1965
#define CMP2OUT                       1966
#define CMP3OUT                       1967
#define CMSTAT_C3OUT                  1968
#define CVRCON                        1969
#define CVR                           1970
#define CVR0                          1971
#define CVR1                          1972
#define CVR2                          1973
#define CVR3                          1974
#define CVR4                          1975
#define CVRR                          1976
#define CVRSS                         1977
#define CVROEN                        1978
#define CVROE                         1979
#define CVREN                         1980
#define PIE4                          1981
#define CCP3IE                        1982
#define CCP4IE                        1983
#define CCP5IE                        1984
#define CCP6IE                        1985
#define CCP7IE                        1986
#define CCP8IE                        1987
#define CCP9IE                        1988
#define CCP10IE                       1989
#define PIR4                          1990
#define CCP3IF                        1991
#define CCP4IF                        1992
#define CCP5IF                        1993
#define CCP6IF                        1994
#define CCP7IF                        1995
#define CCP8IF                        1996
#define CCP9IF                        1997
#define CCP10IF                       1998
#define IPR4                          1999
#define CCP3IP                        2000
#define CCIP3IP                       2001
#define CCP4IP                        2002
#define CCP5IP                        2003
#define CCP6IP                        2004
#define CCP7IP                        2005
#define CCP8IP                        2006
#define CCP9IP                        2007
#define CCP10IP                       2008
#define PIE5                          2009
#define TMR4IE                        2010
#define TMR5IE                        2011
#define TMR6IE                        2012
#define TMR7IE                        2013
#define TMR8IE                        2014
#define TMR10IE                       2015
#define TMR12IE                       2016
#define TMR7GIE                       2017
#define PIR5                          2018
#define TMR4IF                        2019
#define TMR5IF                        2020
#define TMR6IF                        2021
#define TMR7IF                        2022
#define TMR8IF                        2023
#define TMR10IF                       2024
#define TMR12IF                       2025
#define TMR7GIF                       2026
#define CCP1CON                       2027
#define CCP1M0                        2028
#define CCP1M                         2029
#define CCP1M1                        2030
#define CCP1M2                        2031
#define CCP1M3                        2032
#define CCP1Y                         2033
#define DC1B                          2034
#define DC1B0                         2035
#define CCP1X                         2036
#define DC1B1                         2037
#define P1M                           2038
#define P1M0                          2039
#define P1M1                          2040
#define CCPR1L                        2041
#define CCPR1H                        2042
#define ECCP1DEL                      2043
#define P1DC                          2044
#define P1DC0                         2045
#define P1DC1                         2046
#define P1DC2                         2047
#define P1DC3                         2048
#define P1DC4                         2049
#define P1DC5                         2050
#define P1DC6                         2051
#define P1RSEN                        2052
#define PSS1BD0                       2053
#define PSS1BD                        2054
#define PSS1BD1                       2055
#define PSS1AC                        2056
#define PSS1AC0                       2057
#define PSS1AC1                       2058
#define ECCP1AS                       2059
#define ECCP1AS0                      2060
#define ECCP1AS1                      2061
#define ECCP1AS2                      2062
#define ECCP1ASE                      2063
#define ADCON2                        2064
#define ADCS0                         2065
#define ADCS                          2066
#define ADCS1                         2067
#define ADCS2                         2068
#define ACQT0                         2069
#define ACQT                          2070
#define ACQT1                         2071
#define ACQT2                         2072
#define ADFM                          2073
#define ADCON1                        2074
#define CHSN0                         2075
#define CHSN                          2076
#define CHSN1                         2077
#define CHSN2                         2078
#define VNCFG                         2079
#define CHSN3                         2080
#define VCFG                          2081
#define VCFG01                        2082
#define VCFG0                         2083
#define VCFG11                        2084
#define VCFG1                         2085
#define TRIGSEL                       2086
#define TRIGSEL0                      2087
#define TRIGSEL1                      2088
#define ADCON0                        2089
#define ADON                          2090
#define nDONE                         2091
#define GO_nDONE                      2092
#define NOT_DONE                      2093
#define GODONE                        2094
#define GO_DONE                       2095
#define DONE                          2096
#define GO_NOT_DONE                   2097
#define GO                            2098
#define CHS0                          2099
#define CHS                           2100
#define CHS1                          2101
#define CHS2                          2102
#define CHS3                          2103
#define CHS4                          2104
#define ADRESL                        2105
#define ADRESH                        2106
#define SSP1CON2                      2107
#define SEN1                          2108
#define SSP1CON2_SEN                  2109
#define ADMSK11                       2110
#define SSP1CON2_RSEN                 2111
#define RSEN1                         2112
#define SSP1CON2_ADMSK1               2113
#define SSP1CON2_PEN                  2114
#define ADMSK21                       2115
#define PEN1                          2116
#define SSP1CON2_ADMSK2               2117
#define ADMSK31                       2118
#define RCEN1                         2119
#define SSP1CON2_RCEN                 2120
#define SSP1CON2_ADMSK3               2121
#define SSP1CON2_ACKEN                2122
#define ACKEN1                        2123
#define ADMSK41                       2124
#define SSP1CON2_ADMSK4               2125
#define ACKDT1                        2126
#define ADMSK51                       2127
#define SSP1CON2_ACKDT                2128
#define SSP1CON2_ADMSK5               2129
#define SSP1CON2_ACKSTAT              2130
#define ACKSTAT1                      2131
#define GCEN1                         2132
#define SSP1CON2_GCEN                 2133
#define SSP1CON1                      2134
#define SSP1CON1_SSPM0                2135
#define SSPM01                        2136
#define SSP1CON1_SSPM                 2137
#define SSP1CON1_SSPM1                2138
#define SSPM11                        2139
#define SSP1CON1_SSPM2                2140
#define SSPM21                        2141
#define SSPM31                        2142
#define SSP1CON1_SSPM3                2143
#define SSP1CON1_CKP                  2144
#define CKP1                          2145
#define SSPEN1                        2146
#define SSP1CON1_SSPEN                2147
#define SSPOV1                        2148
#define SSP1CON1_SSPOV                2149
#define WCOL1                         2150
#define SSP1CON1_WCOL                 2151
#define SSP1STAT                      2152
#define BF1                           2153
#define SSP1STAT_BF                   2154
#define UA1                           2155
#define SSP1STAT_UA                   2156
#define SSP1STAT_R_NOT_W              2157
#define RW1                           2158
#define NOT_W                         2159
#define SSP1STAT_R                    2160
#define SSP1STAT_nW                   2161
#define RW                            2162
#define SSP1STAT_READ_WRITE           2163
#define SSP1STAT_nWRITE               2164
#define SSP1STAT_I2C_READ             2165
#define SSP1STAT_R_W                  2166
#define SSP1STAT_NOT_WRITE            2167
#define SSP1STAT_R_nW                 2168
#define SSP1STAT_S                    2169
#define START                         2170
#define SSP1STAT_I2C_START            2171
#define START1                        2172
#define STOP                          2173
#define SSP1STAT_P                    2174
#define STOP1                         2175
#define SSP1STAT_I2C_STOP             2176
#define SSP1STAT_D                    2177
#define SSP1STAT_D_NOT_A              2178
#define NOT_A                         2179
#define SSP1STAT_D_A                  2180
#define SSP1STAT_D_nA                 2181
#define SSP1STAT_NOT_ADDRESS          2182
#define SSP1STAT_nA                   2183
#define DA1                           2184
#define DA                            2185
#define SSP1STAT_I2C_DAT              2186
#define SSP1STAT_nADDRESS             2187
#define SSP1STAT_DATA_ADDRESS         2188
#define SSP1STAT_CKE                  2189
#define CKE1                          2190
#define SSP1STAT_SMP                  2191
#define SMP1                          2192
#define SSP1ADD                       2193
#define SSP1ADD_MSK0                  2194
#define MSK01                         2195
#define SSPADD                        2196
#define SSP1ADD_MSK1                  2197
#define MSK11                         2198
#define SSP1ADD_MSK2                  2199
#define MSK21                         2200
#define MSK31                         2201
#define SSP1ADD_MSK3                  2202
#define SSP1ADD_MSK4                  2203
#define MSK41                         2204
#define MSK51                         2205
#define SSP1ADD_MSK5                  2206
