tiborsimon/embedded-tdd-headers/pic/8bit/pic18f86k90_tdd.h
#define MSK61                         2207
#define SSP1ADD_MSK6                  2208
#define SSP1ADD_MSK7                  2209
#define MSK71                         2210
#define SSP1BUF                       2211
#define SSPBUF                        2212
#define T2CON                         2213
#define T2CKPS0                       2214
#define T2CKPS                        2215
#define T2CKPS1                       2216
#define TMR2ON                        2217
#define T2OUTPS0                      2218
#define T2OUTPS                       2219
#define T2OUTPS1                      2220
#define T2OUTPS2                      2221
#define T2OUTPS3                      2222
#define WM0                           2223
#define PR2                           2224
#define WM1                           2225
#define WAIT0                         2226
#define WAIT1                         2227
#define EBDIS                         2228
#define TMR2                          2229
#define T1CON                         2230
#define TMR1ON                        2231
#define T1CON_RD16                    2232
#define NOT_T1SYNC                    2233
#define nT1SYNC                       2234
#define T1OSCEN                       2235
#define T1CON_SOSCEN                  2236
#define T1CKPS0                       2237
#define T1CKPS                        2238
#define T1CKPS1                       2239
#define TMR1CS0                       2240
#define TMR1CS                        2241
#define T1RD16                        2242
#define TMR1CS1                       2243
#define TMR1L                         2244
#define TMR1H                         2245
#define RCON                          2246
#define BOR                           2247
#define NOT_BOR                       2248
#define nBOR                          2249
#define POR                           2250
#define nPOR                          2251
#define NOT_POR                       2252
#define PD                            2253
#define nPD                           2254
#define NOT_PD                        2255
#define nTO                           2256
#define TO                            2257
#define NOT_TO                        2258
#define nRI                           2259
#define NOT_RI                        2260
#define RI                            2261
#define NOT_CM                        2262
#define CM                            2263
#define nCM                           2264
#define SBOREN                        2265
#define IPEN                          2266
#define WDTCON                        2267
#define SWDTEN                        2268
#define SWDTE                         2269
#define ULPSINK                       2270
#define ULPEN                         2271
#define SRETEN                        2272
#define ULPLVL                        2273
#define REGSLP                        2274
#define IPR5                          2275
#define CCH05                         2276
#define TMR4IP                        2277
#define CCH15                         2278
#define TMR5IP                        2279
#define TMR6IP                        2280
#define EVPOL05                       2281
#define TMR7IP                        2282
#define EVPOL15                       2283
#define TMR8IP                        2284
#define TMR10IP                       2285
#define TMR12IP                       2286
#define TMR7GIP                       2287
#define OSCCON                        2288
#define SCS0                          2289
#define SCS                           2290
#define SCS1                          2291
#define HFIOFS                        2292
#define OSTS                          2293
#define IRCF                          2294
#define IRCF0                         2295
#define IRCF1                         2296
#define IRCF2                         2297
#define IDLEN                         2298
#define SPBRGH1                       2299
#define T0CON                         2300
#define T0PS                          2301
#define T0PS0                         2302
#define T0PS1                         2303
#define T0PS2                         2304
#define PSA                           2305
#define T0SE                          2306
#define T0CS                          2307
#define T08BIT                        2308
#define TMR0ON                        2309
#define TMR0L                         2310
#define TMR0H                         2311
#define STATUS                        2312
#define C                             2313
#define CARRY                         2314
#define DC                            2315
#define ZERO                          2316
#define Z                             2317
#define OV                            2318
#define OVERFLOW                      2319
#define N                             2320
#define NEGATIVE                      2321
#define FSR2L                         2322
#define PLUSW2                        2323
#define PREINC2                       2324
#define POSTDEC2                      2325
#define POSTINC2                      2326
#define INDF2                         2327
#define FSR1L                         2328
#define PLUSW1                        2329
#define PREINC1                       2330
#define POSTDEC1                      2331
#define POSTINC1                      2332
#define INDF1                         2333
#define WREG                          2334
#define FSR0L                         2335
#define PLUSW0                        2336
#define PREINC0                       2337
#define POSTDEC0                      2338
#define POSTINC0                      2339
#define INDF0                         2340
#define INTCON3                       2341
#define INT1IF                        2342
#define INT1F                         2343
#define INT2IF                        2344
#define INT2F                         2345
#define INT3F                         2346
#define INT3IF                        2347
#define INT1E                         2348
#define INT1IE                        2349
#define INT2IE                        2350
#define INT2E                         2351
#define INT3E                         2352
#define INT3IE                        2353
#define INT1P                         2354
#define INT1IP                        2355
#define INT2IP                        2356
#define INT2P                         2357
#define INTCON2                       2358
#define RBIP                          2359
#define INT3IP                        2360
#define INT3P                         2361
#define TMR0IP                        2362
#define T0IP                          2363
#define INTEDG3                       2364
#define INTEDG2                       2365
#define INTEDG1                       2366
#define INTEDG0                       2367
#define RBPU                          2368
#define NOT_RBPU                      2369
#define nRBPU                         2370
#define INTCON                        2371
#define RBIF                          2372
#define INT0F                         2373
#define INT0IF                        2374
#define T0IF                          2375
#define TMR0IF                        2376
#define RBIE                          2377
#define INT0E                         2378
#define INT0IE                        2379
#define T0IE                          2380
#define TMR0IE                        2381
#define PEIE                          2382
#define PEIE_GIEL                     2383
#define GIEL                          2384
#define GIE_GIEH                      2385
#define GIE                           2386
#define GIEH                          2387
#define PRODL                         2388
#define PRODH                         2389
#define TABLAT                        2390
#define TBLPTRL                       2391
#define TBLPTRH                       2392
#define PCL                           2393
#define PCLATH                        2394
#define PCH                           2395
#define SP0                           2396
#define STKPTR                        2397
#define SP1                           2398
#define SP2                           2399
#define SP3                           2400
#define SP4                           2401
#define STKUNF                        2402
#define STKOVF                        2403
#define STKFUL                        2404
#define TOSL                          2405
#define TOSH                          2406

#endif // _PIC18F86K90_H_
